blog-posts/2003-05-31-message-to-planner.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Message to planner</title>
<!-- 2014-04-30 Wed 17:37 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Message to planner</h1>
<p>
May 31st, 2003 -
<a href="http://sachachua.com/blog/p/796"><a href="http://sachachua.com/blog/p/796">http://sachachua.com/blog/p/796</a></a>
</p>

<pre class="example">
(defun message-to-planner ()
  "Logs this message to the News and Mail section of today's planner file."
  (save-window-excursion
    (let ((string (concat
             (format-time-string "%R")
             " | " (if (message-fetch-field "newsgroups")
                       (concat " News " (message-fetch-field "newsgroups"))
                     (concat " Mail " (message-fetch-field "to")))
             " | Subject: \"" (message-fetch-field "subject") "\""
             " | Message-ID: " (message-fetch-field "message-id")
             "\n")))22
      (planner-goto-today)
      (planner-seek-to-first "News and Mail")
      (insert string))))

(add-hook 'message-sent-hook 'message-to-planner)
</pre>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
